{
  "version": "1.0",
  "application": "DDA2E Quality Collection",
  "type": "quality-collection",
  "name": "Stance Qualities 2",
  "description": "Advanced combat stances for Stage 3+ Digimon",
  "lastUpdated": "2025-01-07",
  "qualities": [
    {
      "stage": "Perfect",
      "name": "SENTRY AIM",
      "type": "Trigger",
      "dpCost": 2,
      "description": "**REQUIREMENT: STAGE 3+**\n\nThe Digimon gains access to a unique stance, **Sentry Stance**. The Digimon may enter this Stance using the **Stance Change Action**.\n\nWhile in this stance, it gains the following benefits and detriments:\n\n- When activating this Stance, the Digimon places a **Sentry Zone** following the same rules as a **[BLAST]** Area Attack. Any Digimon that enters or exits this Zone may be immediately attacked by this Digimon using a **[RANGE] [DAMAGE]** Attack as a **Free Interrupt Action** so long as this Digimon is in Sentry Stance, ignoring the One Attack Per Round rule and not counting towards it. This attack can have no extra Tags. The Digimon may move this Zone as **1 Action**. If a Target was already hit by this Quality this Round they cannot be hit by this Quality again from this or any other Digimon in Sentry Stance.\n- The Digimon does not suffer any penalties to Accuracy for its **[RANGE]** Attacks (including from firing within Effect Limit, making Called Shots and from Effects).\n- The Digimon suffers a -2 Dodge penalty against **[MELEE]** Tagged attacks, and cannot target enemies within 2 spaces.\n- The Digimon treats all terrain as if they're in Difficult Terrain.",
      "tags": ["stance", "sentry", "ranged", "interrupt", "zone", "stage-3-requirement"]
    },
    {
      "stage": "Perfect",
      "name": "MARTIAL STRIKES",
      "type": "Trigger",
      "dpCost": 2,
      "description": "**REQUIREMENT: STAGE 3+, 1 RANK OF WEAPON**\n\nThe Digimon gains access to a unique stance, **Martial Stance**. The Digimon may enter this Stance using the **Stance Change Action**.\n\nWhile in this stance, it gains the following benefits and detriments:\n- Once per round as a **Free Action**, the Digimon may target a single Digimon it can see and make a **BIT (Decipher Intent) Check**. The TN equals 12 + the Target’s DOS. On a success, whenever the Digimon makes a **[WEAPON]** Tagged Attack against that Target until the start of its next turn, it treats any 6s it rolled on the Accuracy Check as 2 successes instead of 1 (up to 3 times per roll). On a Critical Success, it also doubles the bonus to Accuracy and Damage provided by **[WEAPON]** (this does not include benefits provided by Digizoid Weaponry). If the Digimon makes an Area Attack that includes the Target, any benefits provided by this Quality do not apply to any other Targets within the area.\n- The Digimon takes a penalty to Dodge against any Attacks from Digimon unaffected by this Quality equal to its Stage.",
      "tags": ["stance", "martial", "weapon", "accuracy", "stage-3-requirement", "requires-weapon"]
    },
    {
      "stage": "Perfect",
      "name": "ANTICIPATE ASSAULT",
      "type": "Trigger",
      "dpCost": 2,
      "description": "**REQUIREMENT: STAGE 3+, 1 RANK OF INSTINCT**\n\nThe Digimon gains access to a unique stance, **Anticipate Stance**. The Digimon may enter this Stance using the **Stance Change Action**.\n\nWhile in this stance, it gains the following benefits and detriments:\n- Once per round as a **Free Action**, the Digimon may target a single Digimon it can see and make a **RAM (Evasion) Check**. The TN equals 12 + the Target’s DOS. On a Success, whenever the Target attempts to attack the Digimon until the start of its next turn, the Digimon treats any 6s it rolled on the Dodge Check as 2 successes instead of 1. On a Critical Success, it also doubles the bonus to Dodge provided by Instinct and the Target’s Attacks do not lower its Dodge Pool (unless they have Sniper or Coordinated Assault).\n- The Digimon takes a penalty to Armor against any Attacks from Digimon unaffected by this Quality equal to its Stage.",
      "tags": ["stance", "anticipate", "dodge", "instinct", "stage-3-requirement", "requires-instinct"]
    }
  ]
}
